{
  "recipe": [
    {
      "id": "2",
      "image": "https://diethood.com/wp-content/uploads/2020/01/Baked-Shrimp-5-500x500.jpg"
      "name": "Baked Shrimp Scampi",
      "source": "Ina Garten: Barefoot Contessa Back to Basics",
      "instructions": "Preheat the oven to 425 degrees F.\r\n\r\nDefrost shrimp by putting in cold water, drain. Place the shrimp in serving dish (9x13 or 2 quart casserole) and toss gently with the olive oil, wine, 1 teaspoons salt, and 1 teaspoon pepper. Allow to sit at room temperature while you make the butter and garlic mixture.\r\n\r\nIn a small bowl, mash the softened butter with the garlic, shallots, parsley, rosemary, red pepper flakes, lemon zest, lemon juice, egg yolk, panko, 1\/2 teaspoon salt, and 1\/4 teaspoon of pepper until combined.\r\n\r\nSpread the butter mixture evenly over the shrimp. Bake for 10 to 12 minutes until hot and bubbly. If you like the top browned, place under a broiler for 1-3 minutes (keep an eye on it). Serve with lemon wedges and French bread.\r\n\r\nNote: if using fresh shrimp, arrange for presentation. Starting from the outer edge of a 14-inch oval gratin dish, arrange the shrimp in a single layer cut side down with the tails curling up and towards the center of the dish. Pour the remaining marinade over the shrimp. ",
      "ingredients": [
        "2\/3 cup panko\r",
        "1\/4 teaspoon red pepper flakes\r",
        "1\/2 lemon, zested and juiced\r",
        "1 extra-large egg yolk\r",
        "1 teaspoon rosemary, minced\r",
        "3 tablespoon parsley, minced\r",
        "4 clove garlic, minced\r",
        "1\/4 cup shallots, minced\r",
        "8 tablespoon unsalted butter, at room temperature\r",
        "2 tablespoon dry white wine\r",
        "Freshly ground black pepper\r",
        "Kosher salt\r",
        "3 tablespoon olive oil\r",
        "2 pound frozen shrimp"
      ],
    },
    {
      "id": "4",
      "image": "https://img.sndimg.com/food/image/upload/q_92,fl_progressive,w_1200,c_scale/v1/img/recipes/92/46/1/picYSm1Ss.jpg"
      "name": "Strawberries Romanov (La Madeleine copycat)",
      "source": "http:\/\/cookeatshare.com\/recipes\/la-madeleine-s-strawberries-romanov-318025",
      "instructions": "Wash strawberries and cut the tops off. Let strawberries drain.  Mix together heavy whipping cream, powdered sugar, and the brandy. Beat with a mixer till this becomes thick.  Place strawberries into glasses and spoon over the sauce.\r\n",
      "ingredients": [
        "2 tbsp powdered sugar\r",
        "1\/2 pt heavy whipping cream\r",
        "1 lb strawberries, (2 pints)\r",
        "4 tbsp brandy"
      ],
    },
    
    {
      "id": "5",
      "image": "https://www.jessicagavin.com/wp-content/uploads/2019/09/tomato-basil-soup-14-1200.jpg"
      "name": "Tomato Basil Soup (La Madeleine copycat)",
      "source": "http:\/\/cookeatshare.com\/recipes\/la-madeleine-s-tomato-basil-soup-318026",
      "instructions": "Combine tomatoes, juice\/and or possibly stock in saucepan. Simmer 30 min. Puree, along with the basil leaves, in small batches, in blender or food processor or use an immersion blender in the pan.\r\n\r\nReturn to saucepan and add in cream and butter, while stirring over low heat. Garnish with basil leaves and serve with your favorite bread.",
      "ingredients": [
        "4 c tomatoes, minced, peeled, and cored\r",
        "4 cup vegetable stock\r",
        "12 basil leaves\r",
        "1 c heavy cream\r",
        "1\/4 lb unsalted butter\r",
        "Salt\r",
        "1\/4 tsp black pepper"
      ],
     
    },
   
    {
      "id": "7",
      "image": "https://4.bp.blogspot.com/_xgJQJ1oH3oE/TOgiT_NYFhI/AAAAAAAABhk/ErZ4i70EsxY/s1600/Thanksgiving+pies+and+cake.jpg"
      "name": "John Thorne's Pecan Pie",
      "source": "http:\/\/chowhound.chow.com\/topics\/281175#1495442",
      
      "instructions": "Preheat oven to 350F. In a large saucepan, heat the brown sugar, golden syrup and butter to the boiling point. Stirring constantly and scraping back any foam that clings to the side of the pan, let this mixture boil for about 1 minute. Remove from the heat and let cool while, in a separate bowl, you beat the eggs until creamy. \r\n\r\nWhen the boiled syrup has cooled, beat in the eggs, salt and pecans. Pour into the unbaked pie shell and bake for about 50 minutes.\r\n\r\nNotes:\r\n\r\n* A little cream (about 1\/4 to 1\/2 cup) mixed into a pecan pie filling before baking gives it a richer, lighter texture. \r\n\r\n* For a sweeter, lighter pie: add more sugar and use fewer pecans; for a denser, less sweet pie: add more pecans and use less sugar. \r\n\r\n* The buttery flavour and the lard-induced flakiness of a butter and lard crust make it the perfect one for a perfect pecan pie. And a Southern pecan pie authority I know suggests that you roll out the dough a little thicker than usual; a thick, richly shortened crust provides an appetizing balance to the sweetness of the filling. ",
      "ingredients": [
        "1\/4 tsp salt \r",
        "3 eggs \r",
        "4 tbsp butter \r",
        "2 tbsp dark rum \r",
        "2\/3 cup golden syrup \r",
        "1 cup dark brown sugar, well-packed\r",
        "2 cup pecans, chopped \r",
        "9-inch unbaked pie shell"
      ],
     
    },
    
    {
      "id": "8",
      "image": "https://i.pinimg.com/originals/ee/04/16/ee041640819e4f209c27ba40b8fcc79a.jpg"
      "name": "Smoked Salmon Ebelskivers",
      "source": "Ebelskivers by Kevin Crafts",
     
      "instructions": "Preheat oven to 200F.\r\n\r\nIn a large bowl, whisk together the flour, sugar, baking powder, salt, and pepper. In a small bowl, lightly whisk the egg yolks, then whisk in the milk, 2 tablespoons of melted butter and lemon juice. Add the yolk mixture to the flour mixture and, using a wooden spoon, stir until well blended. The batter will be lumpy.\r\n\r\nIn a clean bowl, using an electric mixer on high speed, beat the egg whites until stiff, but not dry, peaks form. Using a silicone spatula, fold about one-third of the egg whites into the batter to lighten it, then fold in the rest just until no white streaks remain. Stir in fresh dill.\r\n\r\nBrush the wells of the ebelskiver pan with some of the remaining melted butter and place over medium heat. When the butter starts to bubble, add about 1 tablespoon batter to each well. Working quickly, carefully spoon about 1\/2 teaspoon of the smoked salmon into the center of each pancake, then spoon about 1\/2 teaspoon of the cream cheese on top. Top each with another 1 tablespoon batter. (Alternatively, gently mix the cream cheese and salmon together. Spoon about 1 teaspoon into the center of each pancake)\r\n\r\nCook until the bottoms of the pancakes are lightly browned and crisp, 3-5 minutes. Use 2 short wooden skewers to turn all the  pancakes and cook until lightly browned on the second side, about 3 minutes longer.\r\n\r\nTransfer the finished pancakes to a platter and keep warm  in the oven while you repeat to make 2 more batches. Serve right away.",
      "ingredients": [
        "1 cup all-purpose flour\r",
        "1 1\/2 tsp sugar\r",
        "1\/2 tsp baking powder\r",
        "1\/4 tsp salt\r",
        "1\/2 tsp pepper, freshly ground\r",
        "2 large eggs, separated\r",
        "1 cup milk\r",
        "3 tbsp unsalted butter, melted and slightly cooled, divided use\r",
        "1 tsp fresh lemon juice\r",
        "1\/4 cup fresh dill, chopped and firmly packed\r",
        "3 1\/2 tbsp smoked salmon, minced (about 4 oz)\r",
        "3 1\/2 tbsp whipped-style cream cheese, at room temperature\r",
        "2 servings [cocktail sauce](http:\/\/www.xanthir.com\/recipes\/showrecipe.php?id=id50)"
      ],
      
    },
    
    {
      "id": "9",
      "image": "https://www.yourhomebasedmom.com/wp-content/uploads/2017/04/Chocolate-Angel-Pie_0007.jpg"
      "name": "Godiva Angel Pie",
      "source": "everyrecipe.com",
      
      "instructions": "TO MAKE SHELL: Preheat oven to 300 degrees. In mixer bowl, beat egg whites until foamy. Beat in salt and cream of tartar and beat until soft peaks form. Add sugar, a tablespoon at a time, beating after each addition. Continue until very stiff peaks form. Fold in nuts and vanilla. Lightly butter a metal 8-inch pie plate. (Do NOT use glass.) Spoon meringue into pan lightly, building up the edges to come at least 1\/2 inch above the side of the pan. Bake in preheated 300 degree oven for 35 to 40 minutes until light brown. Cool completely before adding filling. TO MAKE FILLING: Melt chocolate and water in a pan over hot, but not boiling, water, stirring occasionally, to blend. Add vanilla and chocolate mixture (cooled) to whipped cream and pile into meringue shell, swirling top with spatula. Be sure to cool the chocolate mixture before adding to the whipped cream. If it is too warm, the mixture will thin out. If this happens, chill until it is thick enough to put in shell.",
      "ingredients": [
        "4 (1 oz.) squares Godiva cooking chocolate or 4 oz. Baker's German sweet chocolate\r",
        "1\/2 tsp vanilla\r",
        "1 cup pecans, finely chopped\r",
        "1\/2 cup sugar\r",
        "1\/8 tsp cream of tartar\r",
        "1\/8 tsp salt\r",
        "2 egg whites, at room temperature\r",
        "3 tbsp water\r",
        "1 tsp vanilla\r",
        "1 cup heavy cream, whipped"
      ],
      
    },
    
    {
      "id": "10",
      "image": "https://www.tasteofhome.com/wp-content/uploads/2018/01/Spaetzle-Dumplings_EXPS_FT19_26501_F_1114_1-1-696x696.jpg"
      "name": "Spaetzle",
      "source": "foodnetwork.com",
      
      "instructions": "Bring a saucepan of salted water it a boil, reduce the heat, and maintain a simmer. In a bowl, stir all the ingredients together (eggs, flour, milk, salt, baking powder, and nutmeg). Place a colander over the pan, pour about1\/4 of the batter into the colander, and press through the holes with a plastic spatula into the hot water. When the spatzle starts to float to the surface, cover the pan and keep covered until the spatzle appears to swell and is fluffy. Remove the dumplings and repeat the procedure with the remaining batter.\r\n\r\nIn a medium saute pan, add butter, and melt over medium heat until butter turns a light brown. Add garlic and cook until it becomes lightly colored. Add spaetzle to the pan to heat through. Add parsley, cheese, salt and pepper, to taste.",
      "ingredients": [
        "2 teaspoon fresh parsley, chopped\r",
        "1 teaspoon garlic, minced\r",
        "3 tablespoon butter\r",
        "1 pinch nutmeg\r",
        "1\/4 teaspoon baking powder\r",
        "1 teaspoon salt\r",
        "1\/2 cup milk\r",
        "1 1\/2 cup flour, sifted\r",
        "2 eggs, slightly beaten\r",
        "2 tablespoon finely grated Parmesan, plus extra for garnish\r",
        "Salt and freshly ground black pepper"
      ],
      
    },
    
    {
      "id": "11",
      "image": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2010/3/24/0/MN0208_pot-roast-carbonnade_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371591232170.jpeg"
      "name": "Pot Roast Carbonnade",
      "source": "Melissa D'Arabian, FoodNetwork",
     
      "instructions": "Preheat the oven to 325 degrees F.\r\n\r\nIn a large Dutch oven over medium-low heat, add the bacon and cook until it renders its fat and almost becomes crispy. Remove it with a slotted spoon to a plate. Add the onions, season with salt and pepper, to taste, and cook over low heat until they are deep in color and caramelized, about 30 minutes.\r\n\r\nRemove the onions to a plate, leaving as much fat in the pot as possible. Add the vegetable oil and mix it with the bacon fat. Raise the heat to high. Season the beef liberally with salt and pepper and sear, in batches, until nicely browned on both sides.\r\n\r\nOnce the meat is browned, add the first batch of meat back to the pan along with the onions, carrots and bacon. Sprinkle in the flour and stir. Cook for 1 minute before deglazing the pan with the beer. Add the remaining ingredients and bring the mixture to a simmer. Cover the pot and put it in the oven to braise until the beef is tender, about 2 hours. Remove the pot from the oven and transfer the pot roast to a serving dish.",
      "ingredients": [
        "1\/2 pound bacon, cut into large lardons\r",
        "2 medium onions, sliced\r",
        "Kosher salt and freshly ground black pepper\r",
        "1 tablespoon vegetable oil\r",
        "1 1\/2 pound beef chuck, cut into large cubes\r",
        "5 carrots, peeled and cut into large chunks\r",
        "1 tablespoon all-purpose flour\r",
        "12 ounce beer (dark or light)\r",
        "6 prunes\r",
        "1 tablespoon dried thyme\r",
        "1 cup beef stock"
      ],
     
    },
   
    {
      "id": "12",
      "image": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fimages.media-allrecipes.com%2Fuserphotos%2F8643443.jpg"
      "name": "Old Fashion Vegetable Soup",
      "source": "Lee Ann Foulger",
      
      "instructions": "In a large soup pot, brown ground beef and onion, drain off fat.  Add remaining ingredients EXCEPT for last 3 items (canned vegetables).  Simmer on low heat until vegetables are tender, about an hour.  Add canned vegetables and simmer 5 minutes.  Remove bay leaf and serve.",
      "ingredients": [
        "1 pound ground beef\r",
        "1 cup onion, chopped\r",
        "1 cup potatoes, diced\r",
        "1 cup carrots, sliced\r",
        "1 cup celery, diced\r",
        "2 16oz can diced tomatoes in juice (or substitute 2 small cans of tomato sauce)\r",
        "4 cup water\r",
        "1\/4 tsp dried basil, crushed\r",
        "1\/4 tsp dried thyme\r",
        "1 bay leaf\r",
        "1\/2 tsp salt\r",
        "1\/4 tsp pepper\r",
        "1\/2 tsp garlic powder\r",
        "2 tablespoon beef bouillon\r",
        "1 16oz can corn\r",
        "1 16oz can green beans\r",
        "1 16oz can green peas"
      ],
     
    },
    
    {
      "id": "13",
      "image": "https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/1200x1200/Onion-Pie_EXPS_FTTMZ19_4046_E03_13_3b_rms.jpg"
      "name": "Onion Pie",
      "source": "Houston Chronicle 1\/18\/2006",
      
      "instructions": "Preheat the oven to 400 degrees halfway through onion cooking.\r\n\r\nSlice the onions and saute in 4 tablespoons butter over medium-low heat; the longer you cook them - as long as 35 minutes - the sweeter they will be.  Sprinkle in crushed red pepper.\r\n\r\nMelt the remaining 4 tablespoons butter.  Mix with the crushed crackers, then press the mixture into the bottom and sides of a glass pie plate to form a crust.  Prebake crust for 10 minutes.\r\n\r\nLightly beat the eggs and milk together in a small bowl.\r\n\r\nSpoon the onions into the crust, then pour the egg mixture over them.  Sprinkle with Parmesan.\r\n\r\nBake for 30-40 minutes until set and golden.",
      "ingredients": [
        "1\/2 cup grated Parmesan cheese\r",
        "1\/2 stack Keebler Club Crackers, crushed\r",
        "2 eggs\r",
        "1 cup milk\r",
        "1\/2 teaspoon crushed red pepper flakes, or to taste\r",
        "1\/2 cup butter, divided use\r",
        "3 large onions"
      ],
     
    },
    
    {
      "id": "14",
      "image": "https://www.thecheesecakefactory.com/assets/images/Menu-Import/960x720-CCF_GodivaCheesecake.jpg"
      "name": "Godiva Dark Chocolate Cheesecake",
      "source": "Godiva.com, Chef Morgan Wilson",
     
      "instructions": "In a food processor with a blade attachment, cream the cheese until smooth and then add in sugar. Pulse a couple times to incorporate sugar and cocoa powder. Add in eggs and yolks pulsing a couple times again and scrape down to ensure all is smooth and uniform. With machine running, pour in melted Godiva Chocolate in a steady stream until all in, and finish by pulsing in the crème fraiche. Pour batter into a 10\" x 10\" baking pan and bake at 325 for 30, minutes or until custard is set and a toothpick inserted in center can be removed cleanly. The top may caramelize or brown slightly, which is not an issue. Once set, remove from oven and allow cheesecake to cool completely. Wrap the pan with plastic and reserve in cooler to set and chill completely.\r\n\r\nOnce the cheesecake is cold and firm, remove it from the pan and place in a mixer bowl with a paddle attachment. Beat the cake for a few moments to soften and smooth out the custard. Place smoothed custard into a piping bag with a plain tip and pipe into the bottom of a plastic lined half cylinder mold. Tap the mold to ensure the custard is solid and then flatten out to top. Freeze the mold to harden the custard for unmolding. Once the cake can be unmolded, remove from the pan and cut into 1½\" sections. Brush some tempered Godiva Dark Chocolate onto a strip of acetate and, while it is still fluid, smooth over the top of the molded cheesecake. Once the chocolate has cooled and completely crystallized, remove the acetate, revealing a shiny and textured chocolate finish.",
      "ingredients": [
        "2 1\/2 cup cream cheese, room temperature\r",
        "1\/2 cup sugar\r",
        "1 3\/4 tablespoon cocoa powder\r",
        "5 tablespoon Godiva 85% Dark Chocolate Callets\r",
        "2 eggs\r",
        "2 egg yolks\r",
        "1 3\/4 tablespoon crème faiche"
      ],
     
    },

    {
      
      "id": "15",
      "image": "https://www.cookingclassy.com/wp-content/uploads/2018/02/greek-salad-4.jpg"
      "name": "Greek Salad",
      "source": "Food Network (two different recipes)",
      "instructions": "In a small bowl, whisk together the lemon juice, garlic, salt, and oil. Set aside.   In a large bowl lightly toss the lettuce with the olives, cheese, cucumber, tomatoes, onion, oregano, and black pepper. Let sit up to 2 hours.  To serve, toss salad with dressing and place sliced chicken on top.",
      "ingredients": [
        "6 tablespoon lemon juice\r",
        "2 clove garlic, minced\r",
        "2 teaspoon kosher salt, plus more to taste\r",
        "1 cup extra-virgin olive oil, preferably Greek\r",
        "<hr>\r",
        "1 head romaine lettuce, trimmed of tough stems and torn into bite-sized pieces\r",
        "1 cup kalamata olives, about 6oz\/cup\r",
        "1\/2 pound Feta cheese, crumbled\r",
        "1 cucumber, trimmed, cut into 1 inch chunks\r",
        "1 1\/2 cup grape tomatoes, halved\r",
        "1 small red onion, cut into 1\/2-inch wedges, soaked in cold water for 5 minutes and drained\r",
        "2 teaspoon dried oregano\r",
        "Freshly ground black pepper"
      ]  
    }

  ]
}
